---
kind: property
id: P:Autodesk.Revit.DB.ElementWorksetFilter.WorksetId
source: html/d22c7537-8460-27e2-46b5-f6a115fe319f.htm
---
# Autodesk.Revit.DB.ElementWorksetFilter.WorksetId Property

The workset id.

## Syntax (C#)
```csharp
public WorksetId WorksetId { get; }
```